Documents/ВыдачаПропуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыдачаПропуска</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПропуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаПропуска/Ext/ManagerModule.bsl
Процедура ПечатьПропуска(ТабДок, Ссылка) Экспорт
    // Получение макета печатной формы
    Макет = Документы.ВыдачаПропуска.ПолучитьМакет("ПечатнаяФормаПропуска");
    
    // Формирование запроса
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ВыдачаПропуска.Заявка.РежимноеПомещение КАК РежимноеПомещение,
    |	ВыдачаПропуска.Дата КАК Дата,
    |	ВыдачаПропуска.ДатаВыдачи КАК ДатаВыдачи,
    |	ВыдачаПропуска.ДатаОкончания КАК ДатаОкончания,
    |	ВыдачаПропуска.ЗонаДоступа КАК ЗонаДоступа,
    |	ВыдачаПропуска.Инициатор КАК Инициатор,
    |	ВыдачаПропуска.ФизическоеЛицо КАК ФизическоеЛицо,
    |	ВыдачаПропуска.ПричиныПосещения КАК ПричиныПосещения,
    |	ВыдачаПропуска.ТипПропуска КАК ТипПропуска,
    |	ВыдачаПропуска.ТочкаКонтроля КАК ТочкаКонтроля,
    |	ВыдачаПропуска.Номер КАК Номер
    |ИЗ
    |	Документ.ВыдачаПропуска КАК ВыдачаПропуска
    |ГДЕ
    |	ВыдачаПропуска.Ссылка В(&Ссылка)";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    
    // Выполнение запроса
    Результат = Запрос.Выполнить();
    
    // Проверка на пустой результат
    Если Результат.Пустой() Тогда
        Сообщить("Нет данных для печати пропуска.", СтатусСообщения.Важное);
        Возврат;
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    
    // Получение областей макета
    Заголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    
    // Очистка табличного документа
    ТабДок.Очистить();
    
    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        // Форматирование дат с учетом возможных пустых значений
        Заголовок.Параметры.Дата = ?(ЗначениеЗаполнено(Выборка.Дата), 
            Формат(Выборка.Дата, "ДЛФ=DD"), "");
        Шапка.Параметры.ДатаВыдачи = ?(ЗначениеЗаполнено(Выборка.ДатаВыдачи), 
            Формат(Выборка.ДатаВыдачи, "ДЛФ=DD"), "");
        Шапка.Параметры.ДатаОкончания = ?(ЗначениеЗаполнено(Выборка.ДатаОкончания), 
            Формат(Выборка.ДатаОкончания, "ДЛФ=DD"), "");
        
        // Заполнение параметров с проверкой на null
        Заголовок.Параметры.Номер = Строка(Выборка.Номер);
        Заголовок.Параметры.РежимноеПомещение = ?(ЗначениеЗаполнено(Выборка.РежимноеПомещение), 
            Выборка.РежимноеПомещение, "");
        Заголовок.Параметры.ТипПропуска = ?(ЗначениеЗаполнено(Выборка.ТипПропуска), 
            Выборка.ТипПропуска, "");
        
        Шапка.Параметры.Инициатор = ?(ЗначениеЗаполнено(Выборка.Инициатор), 
            Выборка.Инициатор, "");
        Шапка.Параметры.ФизическоеЛицо = ?(ЗначениеЗаполнено(Выборка.ФизическоеЛицо), 
            Выборка.ФизическоеЛицо, "");
        Шапка.Параметры.ПричиныПосещения = ?(ЗначениеЗаполнено(Выборка.ПричиныПосещения), 
            Выборка.ПричиныПосещения, "");
        Шапка.Параметры.ЗонаДоступа = ?(ЗначениеЗаполнено(Выборка.ЗонаДоступа), 
            Выборка.ЗонаДоступа, "");
        Шапка.Параметры.ТочкаКонтроля = ?(ЗначениеЗаполнено(Выборка.ТочкаКонтроля), 
            Выборка.ТочкаКонтроля, "");
        
        // Вывод областей в табличный документ
        ТабДок.Вывести(Заголовок);
        ТабДок.Вывести(Шапка);
        
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    
    // Настройки отображения
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабДок.ТолькоПросмотр = Истина;
    ТабДок.ОтображатьСетку = Ложь;
    ТабДок.ОтображатьЗаголовки = Ложь;
    
КонецПроцедуры
